; domain
(define (domain myDomain_large_v4)
(:requirements :strips :equality :typing)
(:types 
Service - Thing
Capability
Design
SiliconMaterial
ImpurityMaterial
ResistMaterial
ChemicalsMaterial
ChipMaterial
Boolean
State
Service_imp2 Service_inv_cl Service_des_ch Service_inv_br Service_des_us Service_inv_ru Service_des_uk Service_dic2 Service_dic1 Service_inv_cn Service_pac_cool1 Service_inv_be Service_lit2 Service_pac1 Service_pac2 Service_imp1 Service_cre1 Service_qua1 Service_pac_cool3 Service_lit1 Service_tes3 Service_pac3 Service_qua2 Service_inv_ca Service_tes2 Service_inv_aus Service_pac_cool2 Service_inv_us Service_sma_tes1 Service_tes1 - Service
)
(:predicates 
(provides ?srv - Service ?c - Capability) 
(taken ?o - Design ?b - Boolean)
(taken ?o - SiliconMaterial ?b - Boolean)
(taken ?o - ImpurityMaterial ?b - Boolean)
(taken ?o - ResistMaterial ?b - Boolean)
(taken ?o - ChemicalsMaterial ?b - Boolean)
(status ?o - Service ?b - State)
(masked ?o - Design ?b - Boolean)
(masked ?o - SiliconMaterial ?b - Boolean)
(masked ?o - ChipMaterial ?b - Boolean)
(lithographed ?o - SiliconMaterial ?b - Boolean)
(lithographed ?o - ChipMaterial ?b - Boolean)
(implanted ?o - ChipMaterial ?b - Boolean)
(implanted ?o - ImpurityMaterial ?b - Boolean)
(implanted ?o - ResistMaterial ?b - Boolean)
(implanted ?o - ChemicalsMaterial ?b - Boolean)
(tested ?o - ChipMaterial ?b - Boolean)
(smart_tested ?o - ChipMaterial ?b - Boolean)
(quality_checked ?o - ChipMaterial ?b - Boolean)
(diced ?o - ChipMaterial ?b - Boolean)
(packed ?o - ChipMaterial ?b - Boolean)
(packed_cool ?o - ChipMaterial ?b - Boolean)
)
(:functions (total-cost))
(:action implant_2
:parameters (?srv - Service_imp2 ?s - ChipMaterial ?b - ImpurityMaterial ?p - ResistMaterial ?c - ChemicalsMaterial)
:precondition (and (provides ?srv implanting) (lithographed ?s true) (taken ?b true) (taken ?p true) (taken ?c true) (implanted ?s false) (implanted ?b false) (implanted ?p false) (implanted ?c false) (status ?srv available) )
:effect (and (implanted ?s true) (implanted ?b true) (implanted ?p true) (implanted ?c true) (not(implanted ?s false)) (not(implanted ?b false)) (not(implanted ?p false)) (not(implanted ?c false)) (increase (total-cost) 5))
)
(:action take_impurity_cl
:parameters (?srv - Service_inv_cl ?d - Design ?b - ImpurityMaterial)
:precondition (and (provides ?srv taking_impurity) (taken ?d true) (taken ?b false) (status ?srv available) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 7))
)
(:action take_design_cn
:parameters (?srv - Service_des_ch ?o - Design)
:precondition (and (provides ?srv taking_design) (taken ?o false) (status ?srv available) )
:effect (and (taken ?o true) (not(taken ?o false)) (increase (total-cost) 11))
)
(:action take_silicon_br
:parameters (?srv - Service_inv_br ?d - Design ?s - SiliconMaterial)
:precondition (and (provides ?srv taking_silicon) (taken ?d true) (taken ?s false) (status ?srv available) )
:effect (and (taken ?s true) (not(taken ?s false)) (increase (total-cost) 6))
)
(:action take_impurity_br
:parameters (?srv - Service_inv_br ?d - Design ?s - ImpurityMaterial)
:precondition (and (provides ?srv taking_impurity) (taken ?d true) (taken ?s false) (status ?srv available) )
:effect (and (taken ?s true) (not(taken ?s false)) (increase (total-cost) 6))
)
(:action take_design_us
:parameters (?srv - Service_des_us ?o - Design)
:precondition (and (provides ?srv taking_design) (taken ?o false) (status ?srv available) )
:effect (and (taken ?o true) (not(taken ?o false)) (increase (total-cost) 1))
)
(:action take_silicon_ru
:parameters (?srv - Service_inv_ru ?d - Design ?s - SiliconMaterial)
:precondition (and (provides ?srv taking_silicon) (taken ?d true) (taken ?s false) (status ?srv available) )
:effect (and (taken ?s true) (not(taken ?s false)) (increase (total-cost) 9))
)
(:action take_design_uk
:parameters (?srv - Service_des_uk ?o - Design)
:precondition (and (provides ?srv taking_design) (taken ?o false) (status ?srv available) )
:effect (and (taken ?o true) (not(taken ?o false)) (increase (total-cost) 6))
)
(:action dic_2
:parameters (?srv - Service_dic2 ?w - ChipMaterial)
:precondition (and (provides ?srv dicing) (tested ?w true) (diced ?w false) (status ?srv available) )
:effect (and (diced ?w true) (not(diced ?w false)) (increase (total-cost) 1))
)
(:action dic_1
:parameters (?srv - Service_dic1 ?w - ChipMaterial)
:precondition (and (provides ?srv dicing) (tested ?w true) (diced ?w false) (status ?srv available) )
:effect (and (diced ?w true) (not(diced ?w false)) (increase (total-cost) 1))
)
(:action take_silicon_cn
:parameters (?srv - Service_inv_cn ?d - Design ?s - SiliconMaterial)
:precondition (and (provides ?srv taking_silicon) (taken ?d true) (taken ?s false) (status ?srv available) )
:effect (and (taken ?s true) (not(taken ?s false)) (increase (total-cost) 11))
)
(:action pack_cool_1
:parameters (?srv - Service_pac_cool1 ?w - ChipMaterial)
:precondition (and (provides ?srv packaging_cooling) (diced ?w true) (packed_cool ?w false) (status ?srv available) )
:effect (and (packed_cool ?w true) (not(packed_cool ?w false)) (increase (total-cost) 1))
)
(:action take_resist_be
:parameters (?srv - Service_inv_be ?d - Design ?b - ResistMaterial)
:precondition (and (provides ?srv taking_resist) (taken ?d true) (taken ?b false) (status ?srv available) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 7))
)
(:action photolithograph_2
:parameters (?srv - Service_lit2 ?s - SiliconMaterial ?c - ChipMaterial)
:precondition (and (provides ?srv photolithography) (masked ?c true) (lithographed ?s false) (lithographed ?c false) (status ?srv available) )
:effect (and (lithographed ?s true) (lithographed ?c true) (not(lithographed ?s false)) (not(lithographed ?c false)) (increase (total-cost) 5))
)
(:action pack_1
:parameters (?srv - Service_pac1 ?w - ChipMaterial)
:precondition (and (provides ?srv packaging) (diced ?w true) (packed ?w false) (status ?srv available) )
:effect (and (packed ?w true) (not(packed ?w false)) (increase (total-cost) 1))
)
(:action pack_2
:parameters (?srv - Service_pac2 ?w - ChipMaterial)
:precondition (and (provides ?srv packaging) (diced ?w true) (packed ?w false) (status ?srv available) )
:effect (and (packed ?w true) (not(packed ?w false)) (increase (total-cost) 1))
)
(:action implant_1
:parameters (?srv - Service_imp1 ?s - ChipMaterial ?b - ImpurityMaterial ?p - ResistMaterial ?c - ChemicalsMaterial)
:precondition (and (provides ?srv implanting) (lithographed ?s true) (taken ?b true) (taken ?p true) (taken ?c true) (implanted ?s false) (implanted ?b false) (implanted ?p false) (implanted ?c false) (status ?srv available) )
:effect (and (implanted ?s true) (implanted ?b true) (implanted ?p true) (implanted ?c true) (not(implanted ?s false)) (not(implanted ?b false)) (not(implanted ?p false)) (not(implanted ?c false)) (increase (total-cost) 5))
)
(:action mask_create_1
:parameters (?srv - Service_cre1 ?s - SiliconMaterial ?d - Design ?c - ChipMaterial)
:precondition (and (provides ?srv mask_creating) (taken ?d true) (taken ?s true) (masked ?d false) (masked ?s false) (masked ?c false) (status ?srv available) )
:effect (and (masked ?d true) (masked ?s true) (masked ?c true) (not(masked ?d false)) (not(masked ?s false)) (not(masked ?c false)) (increase (total-cost) 1))
)
(:action qua_1
:parameters (?srv - Service_qua1 ?a - ChipMaterial)
:precondition (and (provides ?srv checking_quality) (smart_tested ?a true) (quality_checked ?a false) (status ?srv available) )
:effect (and (quality_checked ?a true) (not(quality_checked ?a false)) (increase (total-cost) 5))
)
(:action pack_cool_3
:parameters (?srv - Service_pac_cool3 ?w - ChipMaterial)
:precondition (and (provides ?srv packaging_cooling) (diced ?w true) (packed_cool ?w false) (status ?srv available) )
:effect (and (packed_cool ?w true) (not(packed_cool ?w false)) (increase (total-cost) 9))
)
(:action photolithograph_1
:parameters (?srv - Service_lit1 ?s - SiliconMaterial ?c - ChipMaterial)
:precondition (and (provides ?srv photolithography) (masked ?c true) (lithographed ?s false) (lithographed ?c false) (status ?srv available) )
:effect (and (lithographed ?s true) (lithographed ?c true) (not(lithographed ?s false)) (not(lithographed ?c false)) (increase (total-cost) 5))
)
(:action test_3
:parameters (?srv - Service_tes3 ?a - ChipMaterial)
:precondition (and (provides ?srv testing) (implanted ?a true) (tested ?a false) (status ?srv available) )
:effect (and (tested ?a true) (not(tested ?a false)) (increase (total-cost) 7))
)
(:action pack_3
:parameters (?srv - Service_pac3 ?w - ChipMaterial)
:precondition (and (provides ?srv packaging) (diced ?w true) (packed ?w false) (status ?srv available) )
:effect (and (packed ?w true) (not(packed ?w false)) (increase (total-cost) 7))
)
(:action qua_2
:parameters (?srv - Service_qua2 ?a - ChipMaterial)
:precondition (and (provides ?srv checking_quality) (smart_tested ?a true) (quality_checked ?a false) (status ?srv available) )
:effect (and (quality_checked ?a true) (not(quality_checked ?a false)) (increase (total-cost) 2))
)
(:action take_chemicals_ca
:parameters (?srv - Service_inv_ca ?d - Design ?b - ChemicalsMaterial)
:precondition (and (provides ?srv taking_chemicals) (taken ?d true) (taken ?b false) (status ?srv available) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 2))
)
(:action test_2
:parameters (?srv - Service_tes2 ?a - ChipMaterial)
:precondition (and (provides ?srv testing) (implanted ?a true) (tested ?a false) (status ?srv available) )
:effect (and (tested ?a true) (not(tested ?a false)) (increase (total-cost) 5))
)
(:action take_resist_aus
:parameters (?srv - Service_inv_aus ?d - Design ?b - ResistMaterial)
:precondition (and (provides ?srv taking_resist) (taken ?d true) (taken ?b false) (status ?srv available) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 8))
)
(:action pack_cool_2
:parameters (?srv - Service_pac_cool2 ?w - ChipMaterial)
:precondition (and (provides ?srv packaging_cooling) (diced ?w true) (packed_cool ?w false) (status ?srv available) )
:effect (and (packed_cool ?w true) (not(packed_cool ?w false)) (increase (total-cost) 4))
)
(:action take_impurity_us
:parameters (?srv - Service_inv_us ?d - Design ?b - ImpurityMaterial)
:precondition (and (provides ?srv taking_impurity) (taken ?d true) (taken ?b false) (status ?srv available) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 1))
)
(:action take_silicon_us
:parameters (?srv - Service_inv_us ?d - Design ?s - SiliconMaterial)
:precondition (and (provides ?srv taking_silicon) (taken ?d true) (taken ?s false) (status ?srv available) )
:effect (and (taken ?s true) (not(taken ?s false)) (increase (total-cost) 1))
)
(:action take_resist_us
:parameters (?srv - Service_inv_us ?d - Design ?b - ResistMaterial)
:precondition (and (provides ?srv taking_resist) (taken ?d true) (taken ?b false) (status ?srv available) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 1))
)
(:action take_chemicals_us
:parameters (?srv - Service_inv_us ?d - Design ?b - ChemicalsMaterial)
:precondition (and (provides ?srv taking_chemicals) (taken ?d true) (taken ?b false) (status ?srv available) )
:effect (and (taken ?b true) (not(taken ?b false)) (increase (total-cost) 1))
)
(:action sma_test_1
:parameters (?srv - Service_sma_tes1 ?a - ChipMaterial)
:precondition (and (provides ?srv smart_testing) (implanted ?a true) (smart_tested ?a false) (status ?srv available) )
:effect (and (smart_tested ?a true) (not(smart_tested ?a false)) (increase (total-cost) 5))
)
(:action test_1
:parameters (?srv - Service_tes1 ?a - ChipMaterial)
:precondition (and (provides ?srv testing) (implanted ?a true) (tested ?a false) (status ?srv available) )
:effect (and (tested ?a true) (not(tested ?a false)) (increase (total-cost) 5))
)

)

; problem
(define (problem myProblem_large_v4)
(:domain myDomain_large_v4)
(:objects 
design - Design
silicon - SiliconMaterial
impurity - ImpurityMaterial
resist - ResistMaterial
chemicals - ChemicalsMaterial
chip - ChipMaterial
true - Boolean
false - Boolean
available - State
broken - State
implanting - Capability
taking_impurity - Capability
taking_design - Capability
taking_silicon - Capability
dicing - Capability
packaging_cooling - Capability
taking_resist - Capability
photolithography - Capability
packaging - Capability
mask_creating - Capability
checking_quality - Capability
testing - Capability
taking_chemicals - Capability
smart_testing - Capability
implanter2usa - Service_imp2
inventorychile - Service_inv_cl
designerchina - Service_des_ch
inventorybrazil - Service_inv_br
designerusa - Service_des_us
inventoryrussia - Service_inv_ru
designeruk - Service_des_uk
dicer2usa - Service_dic2
dicer1usa - Service_dic1
inventorychina - Service_inv_cn
packager_cooling1usa - Service_pac_cool1
inventorybelgio - Service_inv_be
lithographer2usa - Service_lit2
packager1usa - Service_pac1
packager2usa - Service_pac2
implanter1usa - Service_imp1
creator1usa - Service_cre1
quality1usa - Service_qua1
packager_cooling3usa - Service_pac_cool3
lithographer1usa - Service_lit1
tester3usa - Service_tes3
packager3usa - Service_pac3
quality2usa - Service_qua2
inventorycanada - Service_inv_ca
tester2usa - Service_tes2
inventoryaustria - Service_inv_aus
packager_cooling2usa - Service_pac_cool2
inventoryusa - Service_inv_us
smarttester1usa - Service_sma_tes1
tester1usa - Service_tes1
)
(:init 
(provides implanter2usa implanting)
(provides inventorychile taking_impurity)
(provides designerchina taking_design)
(provides inventorybrazil taking_silicon)
(provides inventorybrazil taking_impurity)
(provides designerusa taking_design)
(provides inventoryrussia taking_silicon)
(provides designeruk taking_design)
(provides dicer2usa dicing)
(provides dicer1usa dicing)
(provides inventorychina taking_silicon)
(provides packager_cooling1usa packaging_cooling)
(provides inventorybelgio taking_resist)
(provides lithographer2usa photolithography)
(provides packager1usa packaging)
(provides packager2usa packaging)
(provides implanter1usa implanting)
(provides creator1usa mask_creating)
(provides quality1usa checking_quality)
(provides packager_cooling3usa packaging_cooling)
(provides lithographer1usa photolithography)
(provides tester3usa testing)
(provides packager3usa packaging)
(provides quality2usa checking_quality)
(provides inventorycanada taking_chemicals)
(provides tester2usa testing)
(provides inventoryaustria taking_resist)
(provides packager_cooling2usa packaging_cooling)
(provides inventoryusa taking_impurity)
(provides inventoryusa taking_silicon)
(provides inventoryusa taking_resist)
(provides inventoryusa taking_chemicals)
(provides smarttester1usa smart_testing)
(provides tester1usa testing)
(status implanter2usa available)
(status inventorychile available)
(status designerchina available)
(masked chip false)
(lithographed chip false)
(implanted chip false)
(tested chip false)
(diced chip false)
(packed chip false)
(status inventorybrazil available)
(status designerusa available)
(status inventoryrussia available)
(status designeruk available)
(status dicer2usa available)
(status dicer1usa available)
(status inventorychina available)
(taken design false)
(masked design false)
(status packager_cooling1usa available)
(taken impurity false)
(implanted impurity false)
(status inventorybelgio available)
(status lithographer2usa available)
(status packager1usa available)
(status packager2usa available)
(status implanter1usa available)
(taken chemicals false)
(implanted chemicals false)
(status creator1usa available)
(status quality1usa available)
(status packager_cooling3usa available)
(status lithographer1usa available)
(status tester3usa available)
(status packager3usa available)
(status quality2usa available)
(status inventorycanada available)
(status tester2usa available)
(taken silicon false)
(masked silicon false)
(lithographed silicon false)
(taken resist false)
(implanted resist false)
(status inventoryaustria available)
(status packager_cooling2usa available)
(status inventoryusa available)
(status smarttester1usa available)
(status tester1usa available)
(= (total-cost) 0)
)
(:goal 
(and 
(packed chip true)
)
)
(:metric minimize (total-cost))

)

; plan
1. (take_design_us designerusa design)
   deleted: (taken design false)
   added: (taken design true)
   goals met: 0 of 1
2. (take_silicon_us inventoryusa design silicon)
   deleted: (taken silicon false)
   added: (taken silicon true)
   goals met: 0 of 1
3. (mask_create_1 creator1usa silicon design chip)
   deleted: (masked design false) (masked silicon false) (masked chip false)
   added: (masked design true) (masked silicon true) (masked chip true)
   goals met: 0 of 1
4. (photolithograph_1 lithographer1usa silicon chip)
   deleted: (lithographed silicon false) (lithographed chip false)
   added: (lithographed silicon true) (lithographed chip true)
   goals met: 0 of 1
5. (take_resist_us inventoryusa design resist)
   deleted: (taken resist false)
   added: (taken resist true)
   goals met: 0 of 1
6. (take_impurity_us inventoryusa design impurity)
   deleted: (taken impurity false)
   added: (taken impurity true)
   goals met: 0 of 1
7. (take_chemicals_us inventoryusa design chemicals)
   deleted: (taken chemicals false)
   added: (taken chemicals true)
   goals met: 0 of 1
8. (implant_1 implanter1usa chip impurity resist chemicals)
   deleted: (implanted chip false) (implanted impurity false) (implanted resist false) (implanted chemicals false)
   added: (implanted chip true) (implanted impurity true) (implanted resist true) (implanted chemicals true)
   goals met: 0 of 1
9. (test_1 tester1usa chip)
   deleted: (tested chip false)
   added: (tested chip true)
   goals met: 0 of 1
10. (dic_1 dicer1usa chip)
   deleted: (diced chip false)
   added: (diced chip true)
   goals met: 0 of 1
11. (pack_1 packager1usa chip)
   deleted: (packed chip false)
   added: (packed chip true)
   goals met: 1 of 1
